## üö¢ Áí∞Â¢ÉÊ∫ñÂÇô

In [1]:
import pandas as pd
import numpy as np

from sklearn.preprocessing import LabelEncoder

import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

In [2]:
train_raw = pd.read_csv('csv/train.csv') # read:Â≠¶Áøí„Éá„Éº„Çø
test_raw = pd.read_csv('csv/test.csv')   # read:„ÉÜ„Çπ„Éà„Éá„Éº„Çø
print('The size of the train data :', train_raw.shape)
print('The size of the test data :', test_raw.shape)

train_mid = train_raw.copy()
test_mid = test_raw.copy()
train_mid['train_or_test'] = 'train' # add:Â≠¶Áøí„Éá„Éº„Çø„Éï„É©„Ç∞
test_mid['train_or_test'] = 'test'   # add:„ÉÜ„Çπ„Éà„Éá„Éº„Çø„Éï„É©„Ç∞
test_mid['Survived'] = 9             # add:„ÉÜ„Çπ„Éà„Å´Survived„Ç´„É©„É†„Çí‰ªÆÁΩÆ„Åç

alldata = pd.concat([train_mid, test_mid], sort=False, axis=0).reset_index(drop=True)
print('The size of the alldata data:', alldata.shape)

The size of the train data : (891, 12)
The size of the test data : (418, 11)
The size of the alldata data: (1309, 13)

In [3]:
train_mid.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,train_or_test
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,train
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,train
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,train
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,train
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,train

In [4]:
test_mid.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,train_or_test,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,test,9
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,test,9
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,test,9
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,test,9
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,test,9

In [5]:
alldata.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,train_or_test
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,train
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,train
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,train
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,train
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,train

## üö¢ ÂâçÂá¶ÁêÜ

### - Ê¨†ÊêçÂÄ§Ë£úÂÆå

In [6]:
alldata.isnull().sum()

PassengerId         0
Survived            0
Pclass              0
Name                0
Sex                 0
Age               263
SibSp               0
Parch               0
Ticket              0
Fare                1
Cabin            1014
Embarked            2
train_or_test       0
dtype: int64

In [7]:
# Embarked(Âá∫Ê∏Ø)„Å´„ÅØÊúÄÈ†ªÂÄ§„Çí‰ª£ÂÖ•
alldata.Embarked.fillna(alldata.Embarked.mode()[0], inplace=True)
# Fare(ÊñôÈáë)„Å´„ÅØ‰∏≠Â§ÆÂÄ§„Çí‰ª£ÂÖ•
alldata.Fare.fillna(alldata.Fare.median(), inplace=True)
# Ê¨†ÊêçÂÄ§Ë£úÂÆå„Åå„Åï„Çå„Åü„Åã„ÇíÁ¢∫Ë™ç
print(alldata.isnull().sum())

PassengerId         0
Survived            0
Pclass              0
Name                0
Sex                 0
Age               263
SibSp               0
Parch               0
Ticket              0
Fare                0
Cabin            1014
Embarked            0
train_or_test       0
dtype: int64

### - ÁâπÂæ¥ÈáèÂà•Âä†Â∑•

#### „Éª Parch / Sibsp

#### „Éª Ticket

#### „Éª Name

#### „Éª Fare

#### „Éª Cabin

#### „Éª Encoding

## üö¢ „É¢„Éá„É´ÊßãÁØâ

### - „Éô„Éº„Çπ„É©„Ç§„É≥

### - „Éë„É©„É°„Éº„Çø„Éº„ÉÅ„É•„Éº„Éã„É≥„Ç∞

#### „Éª RandomForest

#### „Éª XGBoost

#### „Éª LightGBM

#### „Éª LogisticRegression

#### „Éª SVC

## - Ê±éÂåñÊÄßËÉΩÊ§úË®º

## üö¢ Êé®Ë´ñ